Steps for Data Analysis:
    1. Data Loading
    2. Data Cleaning
    3. Data Transforming
    4. Data Rearrangment

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# 7.1 Handling Missing Data

In [2]:
string_data = pd.Series(data=['Apple', 'Orange', np.nan, 'Banana'])

In [3]:
string_data

0     Apple
1    Orange
2       NaN
3    Banana
dtype: object

NaN(Not a Number)

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

NA (Not Available)

In [5]:
string_data[0] = None

In [6]:
string_data

0      None
1    Orange
2       NaN
3    Banana
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

*Table 7-1. NA handling methods*

![NA handling methods](Img/7.1.png)

In [8]:
df = pd.DataFrame(data=np.random.randn(1024,5), index=np.arange(1024), columns=list('ABCDE'))

In [9]:
df

             A         B         C         D         E
0     2.271313  1.767124 -0.417139 -1.179323 -0.511787
1     1.458493  1.604584  0.532143 -0.268574  0.086024
2     0.285559  1.862293 -0.487194  1.222941 -0.649823
3    -0.978494 -0.667646 -0.172639 -0.873012  0.477971
4    -1.204393  1.192339  0.125861 -0.013035  1.099539
...        ...       ...       ...       ...       ...
1019  0.844554 -1.030583  0.291111  0.912779  0.179775
1020 -0.654604  2.466272  0.761705  0.598039  1.341811
1021 -0.698075 -0.639144 -2.116148 -0.688732  0.650226
1022 -0.647693  1.001485 -2.591511 -0.328065  0.439573
1023 -0.407702  1.518601  1.479383 -0.844099  0.845086

[1024 rows x 5 columns]

In [10]:
df.loc[5][['C', 'D']] = np.nan
df.loc[1021]['A'] = np.nan
df.loc[5] = np.nan

In [11]:
df

             A         B         C         D         E
0     2.271313  1.767124 -0.417139 -1.179323 -0.511787
1     1.458493  1.604584  0.532143 -0.268574  0.086024
2     0.285559  1.862293 -0.487194  1.222941 -0.649823
3    -0.978494 -0.667646 -0.172639 -0.873012  0.477971
4    -1.204393  1.192339  0.125861 -0.013035  1.099539
...        ...       ...       ...       ...       ...
1019  0.844554 -1.030583  0.291111  0.912779  0.179775
1020 -0.654604  2.466272  0.761705  0.598039  1.341811
1021       NaN -0.639144 -2.116148 -0.688732  0.650226
1022 -0.647693  1.001485 -2.591511 -0.328065  0.439573
1023 -0.407702  1.518601  1.479383 -0.844099  0.845086

[1024 rows x 5 columns]

In [12]:
df[(df.isnull()).any(1)]

       A         B         C         D         E
5    NaN       NaN       NaN       NaN       NaN
1021 NaN -0.639144 -2.116148 -0.688732  0.650226

In [13]:
df.dropna(thresh=2)

             A         B         C         D         E
0     2.271313  1.767124 -0.417139 -1.179323 -0.511787
1     1.458493  1.604584  0.532143 -0.268574  0.086024
2     0.285559  1.862293 -0.487194  1.222941 -0.649823
3    -0.978494 -0.667646 -0.172639 -0.873012  0.477971
4    -1.204393  1.192339  0.125861 -0.013035  1.099539
...        ...       ...       ...       ...       ...
1019  0.844554 -1.030583  0.291111  0.912779  0.179775
1020 -0.654604  2.466272  0.761705  0.598039  1.341811
1021       NaN -0.639144 -2.116148 -0.688732  0.650226
1022 -0.647693  1.001485 -2.591511 -0.328065  0.439573
1023 -0.407702  1.518601  1.479383 -0.844099  0.845086

[1023 rows x 5 columns]

In [14]:
df.fillna(value=0)

             A         B         C         D         E
0     2.271313  1.767124 -0.417139 -1.179323 -0.511787
1     1.458493  1.604584  0.532143 -0.268574  0.086024
2     0.285559  1.862293 -0.487194  1.222941 -0.649823
3    -0.978494 -0.667646 -0.172639 -0.873012  0.477971
4    -1.204393  1.192339  0.125861 -0.013035  1.099539
...        ...       ...       ...       ...       ...
1019  0.844554 -1.030583  0.291111  0.912779  0.179775
1020 -0.654604  2.466272  0.761705  0.598039  1.341811
1021  0.000000 -0.639144 -2.116148 -0.688732  0.650226
1022 -0.647693  1.001485 -2.591511 -0.328065  0.439573
1023 -0.407702  1.518601  1.479383 -0.844099  0.845086

[1024 rows x 5 columns]

## Filtering Out Missing Data

In [15]:
data = pd.Series(data=[1, 5, np.nan, 7, 9, np.nan])

In [16]:
data

0    1.0
1    5.0
2    NaN
3    7.0
4    9.0
5    NaN
dtype: float64

In [17]:
data.dropna()

0    1.0
1    5.0
3    7.0
4    9.0
dtype: float64

equivalent to:

In [18]:
data[data.notnull()]

0    1.0
1    5.0
3    7.0
4    9.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned = data.dropna()

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [23]:
#Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data[4] = np.nan

In [25]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
#To drop columns in the same way, pass axis=1
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
df = pd.DataFrame(data=np.random.randn(5,3))

In [28]:
df

          0         1         2
0 -0.271334  1.100488 -1.065180
1  1.045262 -1.477195  0.495599
2  2.265197  0.175053  0.493201
3  2.066989  0.422770 -1.425019
4  0.520064 -1.130920 -0.738951

In [29]:
df.iloc[:2,1] = np.nan

In [30]:
df.iloc[:3,2] = np.nan

In [31]:
df

          0         1         2
0 -0.271334       NaN       NaN
1  1.045262       NaN       NaN
2  2.265197  0.175053       NaN
3  2.066989  0.422770 -1.425019
4  0.520064 -1.130920 -0.738951

In [32]:
df.dropna()

          0        1         2
3  2.066989  0.42277 -1.425019
4  0.520064 -1.13092 -0.738951

In [33]:
#Keep only the rows with at least thresh='2' non-NA values.
df.dropna(thresh=2)

          0         1         2
2  2.265197  0.175053       NaN
3  2.066989  0.422770 -1.425019
4  0.520064 -1.130920 -0.738951

## Filling In Missing Data

Rather than filtering out missing data (and potentially discarding other data along
with it), you may want to fill in the “holes” in any number of ways.

In [34]:
df

          0         1         2
0 -0.271334       NaN       NaN
1  1.045262       NaN       NaN
2  2.265197  0.175053       NaN
3  2.066989  0.422770 -1.425019
4  0.520064 -1.130920 -0.738951

In [35]:
df.fillna(value=0)

          0         1         2
0 -0.271334  0.000000  0.000000
1  1.045262  0.000000  0.000000
2  2.265197  0.175053  0.000000
3  2.066989  0.422770 -1.425019
4  0.520064 -1.130920 -0.738951

In [36]:
#Calling fillna with a dict, you can use a different fill value for each column:
df.fillna(value={0:100, 1:200, 2:300})

          0           1           2
0 -0.271334  200.000000  300.000000
1  1.045262  200.000000  300.000000
2  2.265197    0.175053  300.000000
3  2.066989    0.422770   -1.425019
4  0.520064   -1.130920   -0.738951

In [37]:
df.fillna(value=0, inplace=True)

In [38]:
df

          0         1         2
0 -0.271334  0.000000  0.000000
1  1.045262  0.000000  0.000000
2  2.265197  0.175053  0.000000
3  2.066989  0.422770 -1.425019
4  0.520064 -1.130920 -0.738951

In [39]:
df = pd.DataFrame(np.random.randn(7, 4))

In [40]:
df

          0         1         2         3
0  0.368689  1.319802 -0.093204 -2.176661
1 -1.595528 -0.308678  0.439589  0.969215
2 -0.269263  1.308736  0.747822  0.358399
3  0.470667 -0.221211  0.292496 -0.820597
4 -0.989582 -0.429522 -0.863013 -0.680278
5  0.230411 -1.232555  1.576345 -1.099205
6 -0.005711 -0.110127  0.752200 -1.111825

In [41]:
df.loc[2:4,2] = np.nan

In [42]:
df.iloc[-1:-5:-1,0] = np.nan

In [43]:
df

          0         1         2         3
0  0.368689  1.319802 -0.093204 -2.176661
1 -1.595528 -0.308678  0.439589  0.969215
2 -0.269263  1.308736       NaN  0.358399
3       NaN -0.221211       NaN -0.820597
4       NaN -0.429522       NaN -0.680278
5       NaN -1.232555  1.576345 -1.099205
6       NaN -0.110127  0.752200 -1.111825

In [44]:
df.fillna(method='ffill')

          0         1         2         3
0  0.368689  1.319802 -0.093204 -2.176661
1 -1.595528 -0.308678  0.439589  0.969215
2 -0.269263  1.308736  0.439589  0.358399
3 -0.269263 -0.221211  0.439589 -0.820597
4 -0.269263 -0.429522  0.439589 -0.680278
5 -0.269263 -1.232555  1.576345 -1.099205
6 -0.269263 -0.110127  0.752200 -1.111825

In [45]:
df.fillna(method='bfill')

          0         1         2         3
0  0.368689  1.319802 -0.093204 -2.176661
1 -1.595528 -0.308678  0.439589  0.969215
2 -0.269263  1.308736  1.576345  0.358399
3       NaN -0.221211  1.576345 -0.820597
4       NaN -0.429522  1.576345 -0.680278
5       NaN -1.232555  1.576345 -1.099205
6       NaN -0.110127  0.752200 -1.111825

In [46]:
df.fillna(method='ffill', limit=3)

          0         1         2         3
0  0.368689  1.319802 -0.093204 -2.176661
1 -1.595528 -0.308678  0.439589  0.969215
2 -0.269263  1.308736  0.439589  0.358399
3 -0.269263 -0.221211  0.439589 -0.820597
4 -0.269263 -0.429522  0.439589 -0.680278
5 -0.269263 -1.232555  1.576345 -1.099205
6       NaN -0.110127  0.752200 -1.111825

In [47]:
ser = pd.Series(data=[2, 5.3, np.nan, 7, np.nan, 87, 1.25])

In [48]:
ser

0     2.00
1     5.30
2      NaN
3     7.00
4      NaN
5    87.00
6     1.25
dtype: float64

In [49]:
ser.fillna(value=np.mean(ser))

0     2.00
1     5.30
2    20.51
3     7.00
4    20.51
5    87.00
6     1.25
dtype: float64

*Table 7-2. fillna function arguments*

![Fillna function arguments](Img/7.2.png)

# 7.2 Data Transformation

## Removing Duplicates

In [50]:
df = pd.DataFrame(data={'k1': ['one', 'two']*3 + ['two'], 'k2': [1, 1, 2, 2, 3, 3, 3]})

In [51]:
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   3
6  two   3

In [52]:
# duplicated returns a boolean Series indicating whether each row is a duplicate (has been observed in a previous row) or not:
df.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [53]:
df.duplicated(keep='last')

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [54]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   3

In [55]:
df.drop_duplicates(keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
6  two   3

In [56]:
df['k3'] = range(7)

In [57]:
df

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
5  two   3   5
6  two   3   6

In [58]:
df.drop_duplicates(['k1', 'k2'])

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
5  two   3   5

In [59]:
df.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
6  two   3   6

## Transforming Data Using a Function or Mapping

In [60]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [61]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
d = {'bacon':'pig', 'pulled pork':'pig', 'pastrami': 'cow', 'corned beef':'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [63]:
lowered_case = data['food'].str.lower()

In [64]:
lowered_case

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [65]:
data['animal'] = lowered_case.map(d)

In [66]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [67]:
lowered_case.map(d)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [68]:
data['food'].map(lambda x: d[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations and other
data cleaning–related operations.

## Replacing Values

In [69]:
ser = pd.Series(data=[8.52, 5, -85, 41.02, -85, 1000, 45, -9.0023, -85])

In [70]:
ser

0       8.5200
1       5.0000
2     -85.0000
3      41.0200
4     -85.0000
5    1000.0000
6      45.0000
7      -9.0023
8     -85.0000
dtype: float64

In [71]:
ser.replace(-85, 0)

0       8.5200
1       5.0000
2       0.0000
3      41.0200
4       0.0000
5    1000.0000
6      45.0000
7      -9.0023
8       0.0000
dtype: float64

In [72]:
ser.replace([-85, -9.0023], np.nan)

0       8.52
1       5.00
2        NaN
3      41.02
4        NaN
5    1000.00
6      45.00
7        NaN
8        NaN
dtype: float64

In [73]:
ser.replace([-85, -9.0023, 1000], [np.nan, np.nan, 0])

0     8.52
1     5.00
2      NaN
3    41.02
4      NaN
5     0.00
6    45.00
7      NaN
8      NaN
dtype: float64

In [74]:
ser.replace({-85:np.nan, -9.0023:np.nan, 1000:0})

0     8.52
1     5.00
2      NaN
3    41.02
4      NaN
5     0.00
6    45.00
7      NaN
8      NaN
dtype: float64

In [75]:
ser.replace(ser[ser<0], np.nan)

0       8.52
1       5.00
2        NaN
3      41.02
4        NaN
5    1000.00
6      45.00
7        NaN
8        NaN
dtype: float64

In [76]:
ser

0       8.5200
1       5.0000
2     -85.0000
3      41.0200
4     -85.0000
5    1000.0000
6      45.0000
7      -9.0023
8     -85.0000
dtype: float64

## Renaming Axis Indexes

Like values in a Series, axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects

In [77]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [79]:
data.index = data.index.map(lambda x: str.upper(x))

In [80]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [81]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [82]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [83]:
data.rename(index={'OHIO': 'NY'}, inplace=True)

In [84]:
data

          one  two  three  four
NY          0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## Discretization and Binning

In [85]:
ages = [20, 22, 25, 27, 21, 69, 62, 58, 44, 23, 37, 31, 61, 45, 41, 32]

In [86]:
bins = [18, 25, 35, 60, 100]

In [87]:
cats = pd.cut(ages, bins)

In [88]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 16
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object. The output you see
describes the bins computed by pandas.cut.

In [89]:
cats.codes # .codes attribute returns the label of catgories

array([0, 0, 0, 1, 0, 3, 3, 2, 2, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [90]:
pd.value_counts(cats)

(35, 60]     5
(18, 25]     5
(60, 100]    3
(25, 35]     3
dtype: int64

Consistent with mathematical notation for intervals, a parenthesis means that the side
is open, while the square bracket means it is closed (inclusive).

In [91]:
bins

[18, 25, 35, 60, 100]

In [92]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 16
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [93]:
labels = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [94]:
pd.cut(ages, bins, labels=labels)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 16
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data.
Consider the case of some uniformly distributed data chopped into fourths:

In [95]:
pd.cut(np.random.randn(10), 4, precision=2) #The precision=2 option limits the decimal precision to two digits.

[(-0.21, 0.48], (-0.9, -0.21], (-0.21, 0.48], (-0.21, 0.48], (-0.21, 0.48], (-2.29, -1.6], (-0.21, 0.48], (-0.9, -0.21], (-0.21, 0.48], (-2.29, -1.6]]
Categories (4, interval[float64]): [(-2.29, -1.6] < (-1.6, -0.9] < (-0.9, -0.21] < (-0.21, 0.48]]

In [96]:
#qcuts returns the same size of bins (in Quartiles)
data = np.random.randn(1000)

In [97]:
data

array([-1.01224132e+00, -1.57479488e+00,  1.74901454e+00,  2.92874494e-01,
        3.51519442e-01,  1.50019891e+00,  9.63262814e-01,  3.24696302e-01,
        2.04070033e-01,  7.80163572e-01,  6.98819726e-01, -2.70500455e-01,
        1.70749358e+00,  7.54517913e-02, -3.27933306e-01, -8.29544450e-01,
        9.59907171e-02,  2.12002660e+00,  3.10556998e-03, -1.33888425e+00,
       -2.65608603e-01, -7.40400968e-01,  8.57085509e-01, -1.75656376e+00,
        1.97033541e+00,  1.10489350e+00, -5.82088343e-01,  7.19128241e-01,
       -1.75335127e+00,  9.49032463e-01, -5.50332797e-01,  1.02504690e-01,
       -1.51201173e+00,  6.20827871e-01,  3.88291050e-02,  3.49093003e-01,
        1.71714578e+00,  1.21223606e-01,  2.46137594e-01, -6.49114413e-01,
        3.61860382e-01, -2.19978617e+00, -8.00279796e-01, -5.40811071e-01,
        7.41142412e-01, -1.04309971e+00, -1.57226938e+00, -5.07590035e-02,
        4.19188825e-01, -1.11473144e+00,  5.20107232e-01, -2.60506435e-01,
       -6.59915025e-01, -1.18994972e+00, -1.33186424e-01, -1.53821355e+00,
        7.20301020e-01,  3.45642476e-01, -4.79398754e-01, -2.15358570e+00,
        5.25499410e-01, -6.94861448e-01, -2.22890061e-01, -5.86744555e-02,
        2.01087415e+00, -2.99416267e-01, -1.00599097e+00, -3.11396984e-01,
        8.09836986e-01, -7.53614913e-01, -3.93013861e-01,  3.95556759e-01,
        6.84344872e-01,  4.04670228e-01,  6.91937297e-01,  2.31450893e-01,
        3.98932205e-01,  2.56417321e-01,  6.24040805e-01,  7.87611169e-01,
        6.49967066e-01, -6.93290381e-02,  3.02423928e-01, -9.75004165e-01,
       -3.99672488e-01, -5.60450695e-01,  1.41609536e+00,  4.79574212e-01,
       -1.10958482e+00, -9.39333469e-01, -1.24600045e-01, -1.58817477e+00,
       -2.79895144e-01, -3.35845575e-01, -9.99610960e-01,  4.92970556e-01,
       -9.21228416e-01, -4.72569509e-01,  2.86066762e-01,  4.82132217e-01,
        6.37908841e-01,  1.55702743e+00, -6.44382701e-01, -2.21681828e+00,
       -8.65202365e-01,  1.53445044e+00, -9.59913674e-01, -6.64916164e-01,
        1.19003413e-01,  1.83834787e+00,  4.35585784e-01,  1.79190110e-01,
        1.01718110e-01,  3.09406466e-01,  2.52460366e-01,  9.65308050e-01,
       -1.42223440e+00, -2.35769241e+00,  9.05113275e-01,  7.98870684e-01,
        2.61737798e+00, -1.04539511e+00,  4.53166268e-01, -9.73585308e-01,
        1.17723416e+00,  2.81852305e-01, -1.17886611e+00, -1.82677280e+00,
        9.56855890e-02, -1.71890507e+00,  1.66606444e+00, -9.86100196e-04,
        1.65474434e-01, -2.12495601e-01,  1.48288196e+00,  7.38785133e-01,
       -8.99001970e-01,  1.39868368e+00, -4.70972479e-01,  1.35769285e+00,
       -1.83610308e+00,  7.24695650e-01,  1.77641770e+00,  2.21764314e-01,
        1.45530819e+00, -4.53857112e-01, -2.88165817e-01,  7.04563559e-01,
        1.45130720e+00,  4.21478522e-01, -1.29206445e+00, -7.88416061e-01,
        6.07814492e-02,  1.34471923e+00, -2.26104068e+00,  1.77945549e-01,
        1.24738329e-01,  4.02966903e-01, -2.08522965e-01, -9.41580433e-01,
        5.78125183e-01,  1.49583171e+00,  9.06050759e-01, -1.62937894e+00,
       -1.87212891e+00, -1.25664655e-03, -5.54101257e-01,  8.78631782e-01,
        3.43037803e-01,  1.18621489e+00,  8.98015498e-03,  2.46047432e-01,
       -8.26040074e-01, -4.54001360e-01, -8.96121330e-01,  1.10322633e+00,
        8.04383594e-01,  6.40133308e-01, -6.48439747e-01,  7.45817569e-01,
        1.77320488e-01,  8.51560168e-01, -2.93901698e-01,  3.69491229e-01,
        1.56296077e+00,  8.48084419e-01, -5.85933862e-01, -7.03456310e-01,
       -2.19036879e+00, -1.09695137e+00,  1.37213189e-01, -6.62343394e-02,
        6.06131156e-01,  2.95181228e-01, -1.39080853e+00,  1.79386098e+00,
        1.36093633e-01, -9.29906640e-01, -1.14784002e+00, -3.58738104e-01,
       -3.59018494e-01, -3.92476873e-01,  7.90537031e-01,  9.75367389e-02,
       -3.96630732e-01, -1.05977647e+00, -1.15318141e+00, -2.52525892e-01,
        1.35210661e+00,  1.70915210e+00, -6.22531808e-01, -2.14219066e-01,
        1.33192968e+00, -9.06728141e-01, -9.94641147e-01,  1.18965923e+00,
       -5.55786537e-01,  1.18224832e-01,  1.03279786e+00,  1.30909970e+00,
       -1.11548341e-01, -8.97683786e-01,  6.39210963e-01, -4.37202967e-01,
        3.92256452e-01,  2.29825398e-01, -4.38079877e-01, -1.64394805e+00,
       -4.48492368e-01,  1.38454754e-01,  1.16721376e+00,  4.35898024e-01,
        1.80640857e+00, -3.30684702e-01,  3.08022541e-01, -1.44171454e+00,
       -1.81600300e-01, -1.99753879e+00, -3.76775115e-01, -9.07547336e-01,
        2.60968093e-01, -1.98154734e+00,  1.00824608e+00, -1.06209631e+00,
        3.83957304e-02, -3.77035389e-01,  1.50418796e+00, -1.85301450e-01,
       -8.10153942e-01,  7.37503078e-01,  3.69286506e-01,  1.19051852e+00,
       -1.01867691e-01, -3.66681233e-01,  1.02109717e+00,  1.00855137e+00,
        1.72833448e-01,  7.74183232e-01,  1.16454462e+00,  1.03023660e+00,
       -9.90592089e-01, -1.76755583e+00, -5.50543344e-01, -3.99198658e-01,
       -5.58775798e-01, -7.75922083e-01,  1.17431587e+00,  1.25982249e+00,
        9.37929480e-01,  1.01779077e+00, -5.49062865e-01, -9.25178953e-01,
       -9.89030786e-02, -4.80994548e-01,  9.44977223e-01, -6.81907150e-01,
        1.01702729e+00, -8.78224934e-01,  1.56203323e-01,  1.17779051e-02,
       -8.78040028e-01,  2.41608313e-01, -4.87862700e-02, -1.64148070e-01,
        9.76200660e-01, -1.68022509e+00,  3.28336048e-01,  5.89489119e-01,
        6.64469924e-01, -1.02956786e+00, -1.15225902e+00, -9.03157422e-01,
        9.99328149e-01, -2.40912799e+00, -5.77548640e-01,  8.42046203e-02,
       -7.21001054e-01,  1.06953325e+00, -1.13022538e+00, -3.67288128e-01,
        1.34283754e+00, -5.13749788e-01,  4.55308159e-01,  1.07439027e+00,
        4.68208540e-01, -1.16748857e+00,  1.41953455e+00, -6.36836962e-01,
       -3.52810301e-01, -2.55975577e-01,  8.21852159e-02,  4.92968051e-01,
       -1.33425153e+00, -1.55405841e+00, -1.66809933e+00,  3.95825389e-01,
        2.21626910e+00,  3.79362668e-01,  5.61880074e-01,  1.97741547e+00,
       -1.05571508e+00, -1.21203826e+00, -2.74886607e-01, -6.85907779e-01,
        3.74602091e-01,  9.19768034e-01,  1.44774917e+00, -7.86440295e-01,
        9.39027206e-02, -1.51596304e+00,  6.28200452e-01,  1.04089907e+00,
       -1.38471702e-01, -9.40194389e-01, -6.20268395e-01,  1.26160115e-01,
       -1.51466668e+00,  1.48906423e+00,  1.48834494e+00,  1.03601780e+00,
       -1.15966530e+00,  9.87184870e-01, -1.63526491e+00, -9.62017929e-01,
        1.11532851e+00, -1.10470610e+00,  1.88521087e+00, -2.08741383e+00,
       -5.28820789e-01, -1.18027232e-02, -9.93322200e-01,  1.53458943e+00,
       -7.96837402e-01,  2.11552617e+00, -5.30900160e-01,  4.29810134e-01,
       -1.15752563e-01,  5.82481828e-01, -7.92973963e-01, -3.75264090e-01,
        7.48015064e-01, -5.91598183e-01, -1.28664768e+00, -5.05704555e-01,
        2.07986828e-02, -1.35210631e-01,  7.87180803e-01, -3.93008353e-01,
       -9.85665567e-01, -7.45020723e-01,  7.28260618e-01,  7.27708625e-01,
        2.08639204e+00,  4.78311534e-01,  6.59969561e-02,  1.26381185e+00,
        3.91236553e-02,  6.61918587e-01,  5.34540344e-01, -6.32881562e-03,
        6.99732888e-01,  2.41336047e+00,  7.97217953e-01,  1.08876396e+00,
        8.57527460e-02,  1.46173768e+00,  1.21260700e-01, -6.24363158e-01,
        4.79547375e-01, -1.13837363e-01, -1.03070597e+00, -6.80354634e-01,
       -1.08714103e+00,  1.51176123e+00,  3.21119059e-01, -1.80742761e-02,
       -5.90937629e-01, -1.14101406e+00, -3.67072766e-01,  7.44350224e-01,
        1.22417785e+00,  1.85585063e+00, -1.08118267e+00,  1.46792030e+00,
        3.23442995e-01,  1.41996537e-01,  1.14003001e+00, -9.36518642e-01,
       -1.72524711e-02,  7.85097130e-01,  2.81472354e-02,  7.16515747e-01,
        9.52455052e-01, -5.86263104e-02, -1.38429982e-01, -1.28593184e+00,
       -9.28315324e-01,  1.45840744e+00, -8.07082437e-01,  4.50801323e-01,
        1.02683781e+00, -4.68809515e-01,  1.02584734e-02, -1.03306905e-01,
        7.14328498e-01,  3.10882892e-04, -1.11162010e+00, -7.10401922e-01,
       -9.77130108e-01, -1.55920087e-01, -1.24786068e+00,  2.06574092e+00,
        2.43951192e+00,  3.83542109e-01,  2.98239393e-01, -5.45182863e-01,
        2.89004724e-01,  2.53410904e-01, -3.04911246e-01, -4.53439804e-01,
        6.30534076e-01,  1.32332467e+00,  1.37343509e+00,  5.39635752e-02,
        5.44721271e-01, -1.53966304e+00,  1.00469644e+00,  1.79494548e-01,
        2.38985478e-02, -3.59071486e-01,  9.55439180e-01, -4.13081246e-01,
        1.82828398e-01,  1.11468757e+00, -1.12031980e+00, -8.38193816e-01,
       -8.87697247e-01,  1.02599477e-01,  2.88040686e+00, -1.05294166e+00,
       -1.64346642e-01, -1.28560506e-01,  1.33438268e+00,  1.29237477e+00,
        7.44283968e-01,  6.68949116e-01, -1.98860201e-01, -6.44460178e-01,
       -1.82415913e+00,  1.45922489e-01,  3.77472948e-01, -5.25118336e-01,
       -7.65987939e-01,  9.03589654e-02, -8.53663143e-02, -2.80977235e-02,
        1.09358657e+00,  8.73662552e-02,  7.01704938e-02,  2.10473111e+00,
       -2.05676176e-01,  1.90210809e+00,  2.99125798e-02, -1.22313231e+00,
       -2.31006398e-01, -4.47322235e-01,  6.20936116e-02, -3.11392481e-01,
       -4.53237856e-01, -6.62381803e-01, -1.31593392e-01,  3.26112234e-01,
        7.82749943e-01,  5.58773895e-01,  7.84183769e-02,  1.03420332e+00,
       -7.43415905e-01,  8.47377349e-01,  1.44895748e+00,  1.90330946e+00,
       -1.30473582e-01, -1.09988212e+00, -1.83045604e+00,  1.14942856e+00,
        2.18901527e-01, -8.49447157e-01, -1.04942727e+00, -4.60066376e-02,
       -2.86865042e-01, -7.90309418e-01, -1.20652162e+00, -1.16863859e-02,
       -9.53527649e-01,  5.57081297e-01,  1.26177846e+00,  1.19800211e+00,
        6.04146787e-01, -1.30222035e+00, -1.09447063e+00,  1.35098003e+00,
        1.00660419e+00,  1.62823388e-01, -4.52468169e-01, -3.67212124e-01,
        1.27281965e+00,  1.91738592e+00,  8.53863417e-01, -4.55419101e-01,
        1.10063637e+00, -1.52741272e+00,  3.05640369e-01,  1.35911449e+00,
        1.48460430e+00,  5.49991852e-01,  3.84284688e-01, -5.95961610e-01,
       -1.08436266e+00, -2.35820981e+00,  3.88020608e-01,  5.14129918e-02,
        1.32237409e-01, -8.75643933e-01, -1.63517555e+00, -1.68418022e+00,
        2.36917315e+00, -7.86645749e-01,  8.06984376e-01,  1.23980558e+00,
       -1.58116383e-01,  1.74609309e+00,  5.26057917e-01, -8.65491916e-01,
       -1.49234851e+00, -4.64742147e-02,  8.80544096e-01, -1.95073189e+00,
        1.08379053e+00,  1.15836082e+00, -5.91837138e-03,  9.04345142e-01,
        2.45626999e-01, -5.77725765e-01, -2.87054483e-01, -4.41051605e-01,
        1.12149139e-01, -1.36895734e-02,  4.50350395e-01,  1.05025897e+00,
        9.70469854e-01, -2.12306264e+00, -6.96119477e-01, -2.89463277e-01,
       -2.65035443e+00,  3.88068288e-01,  1.19872435e+00,  1.75681721e+00,
       -1.56169333e+00, -1.27601136e-01,  1.60378736e+00, -9.51878949e-01,
       -1.57756723e+00,  6.15489274e-01,  1.52472196e+00, -4.57564592e-02,
        2.05045011e-01, -1.18308036e-01,  9.36155017e-01, -2.21726765e+00,
       -1.07394815e+00,  9.13942938e-01,  3.13218684e-01, -8.95525951e-01,
        2.60106480e-01,  1.31374049e+00,  1.97007430e-01, -8.88449464e-01,
        1.87338174e+00, -2.06019740e+00, -8.17410260e-01, -1.52466712e-01,
        1.98334993e-01,  2.00003497e+00, -9.22429593e-02,  5.73947962e-01,
        1.00504895e+00, -4.71814163e-01,  7.87990479e-02, -6.67176525e-01,
       -2.88864651e+00,  9.85503800e-01,  1.61817802e+00,  1.73619419e+00,
        4.27427377e-01,  8.18601687e-01, -1.03443791e+00,  1.33376176e+00,
       -7.08907181e-01,  2.60744313e+00, -1.25232891e+00, -1.82320639e-01,
        4.49375219e-01, -6.35487851e-02, -7.60900520e-01,  5.63445163e-01,
        3.80590853e-01,  3.55616951e-01,  2.26714321e-01,  3.12402526e-01,
       -1.54434664e+00,  4.94515115e-01,  2.12844430e-01,  1.31621797e+00,
        1.55815728e+00,  7.54868205e-01, -7.53966741e-01,  1.10110158e+00,
        8.73000962e-01,  7.40570036e-01, -2.18214854e+00, -1.48418828e+00,
       -1.37475453e+00, -2.43100757e-01,  7.04607083e-01,  8.08640394e-01,
       -5.89599556e-01,  4.87119540e-01, -5.56122862e-01, -6.76736798e-01,
        1.74269777e-01,  9.09093207e-01, -1.43465469e+00, -5.12099956e-01,
       -5.01569855e-01,  1.25846399e+00,  1.28645841e+00,  5.81114031e-01,
       -1.13059008e-01,  3.36325382e-01, -1.15481377e-01,  1.99323142e-01,
       -9.98934543e-01, -4.94370925e-01,  5.54060749e-01, -1.79145061e-01,
       -9.65520828e-01, -2.88789027e-01, -3.99414031e-01,  3.88280978e-01,
        1.80067950e+00, -3.11430325e-01,  4.89947416e-01,  1.59332664e+00,
       -1.61679462e-01,  1.31777826e+00,  1.18365373e+00, -1.16773015e+00,
        1.70668448e+00,  5.07755093e-02, -1.72433602e+00,  9.92362440e-01,
       -1.99863004e+00,  1.16111382e+00, -1.32955750e+00,  1.52637659e+00,
        8.76209714e-01,  1.56236600e+00, -1.44762623e+00,  1.65898585e-01,
       -4.23436781e-01, -2.18339848e+00,  7.54361500e-01, -8.67479948e-01,
        5.21648730e-01, -6.72582358e-01,  4.45786090e-01,  5.20301021e-01,
        3.74577033e-01,  1.04878243e-01, -1.42837699e+00, -4.27498381e-01,
       -7.35038276e-01,  8.99068443e-02,  1.59108063e+00, -8.78493570e-01,
        4.47521506e-01,  1.87173676e+00, -5.29845234e-01,  2.06159484e-01,
       -1.56504099e+00,  2.19550139e+00,  1.59042134e+00, -8.72191357e-01,
       -3.87563850e-01, -5.77670040e-02,  2.36740288e-01, -9.66573146e-01,
        4.51002844e-01,  1.42190923e+00, -1.85796139e+00,  1.50001635e+00,
        9.13461371e-01, -1.01808639e+00, -2.09528796e-01, -1.04516950e+00,
       -1.32308168e+00, -1.77315994e-03, -1.99189477e-01, -7.68665732e-01,
        1.63397761e-01,  1.36848459e+00,  8.25134338e-01,  9.29204316e-01,
       -1.15496420e+00,  8.54902697e-01,  1.71767200e+00, -6.87956510e-01,
        3.25193552e-01,  7.20380627e-01, -1.16163320e+00,  1.58336611e+00,
       -1.30938581e+00,  3.27556053e-01,  4.44709685e-01, -2.24353614e-01,
       -3.40115305e-01,  1.62978655e-01,  3.16804885e-01,  9.31579877e-01,
        6.37033465e-02,  1.00417555e+00, -6.07251996e-01, -1.72760830e-01,
       -1.03557881e+00,  6.02893026e-01,  4.06868249e-01, -9.36875094e-01,
        3.89933929e-01,  1.53266765e+00,  6.21877127e-01,  1.22616311e-01,
        2.34212370e+00, -2.32006987e-01,  4.47786296e-01, -1.40704081e+00,
        7.60148843e-01,  1.22697105e+00, -1.75807564e+00,  8.39908760e-01,
        1.77099640e+00, -4.86887037e-01, -3.67834874e-01, -1.42498418e+00,
       -3.65172420e-01, -8.22299869e-01,  1.22604939e-02, -1.09196459e+00,
        3.92042616e-01,  5.34961897e-01,  6.29654886e-01, -5.10948831e-01,
       -1.68013003e-01,  2.75814410e+00,  2.09348267e+00, -3.45431996e-01,
       -5.86109092e-01, -3.16052433e-01, -2.39273696e-01,  7.13529594e-01,
       -2.73847520e-01, -9.29113962e-01, -3.44915254e-01, -1.04104924e+00,
       -1.41386113e-01,  7.27410286e-01, -1.29936565e+00,  4.32386318e-01,
       -7.55195117e-01,  7.93785803e-01, -3.71457103e-01, -6.01509806e-01,
       -6.19425759e-01, -4.13878959e-01,  8.29977927e-01, -2.05515267e+00,
        2.61909850e-01,  1.20811947e+00,  8.25095225e-01, -9.61979429e-01,
        1.72873481e+00,  1.08572019e+00, -1.80374933e+00, -1.23690285e-01,
       -9.22633593e-01, -8.42774574e-01,  5.42455499e-01, -2.32096457e+00,
        8.08524284e-01,  4.41244763e-01, -1.32755476e+00, -1.01463342e+00,
       -1.47014390e-01, -7.78258677e-01,  4.87349639e-01, -1.18975179e+00,
       -8.60506478e-02, -2.06442217e-01, -4.28577252e-01, -9.24964579e-01,
       -1.14989182e+00,  1.51791488e+00,  7.54232634e-01, -2.33725589e-01,
       -7.94355517e-01, -3.60147260e-01, -1.16100013e+00, -3.78687527e-01,
        5.44826857e-01,  9.76463871e-01,  1.22655985e-01,  1.65360525e+00,
        1.46617653e-01,  3.53703707e-01, -1.04395492e+00,  1.74693925e+00,
        6.47043494e-02,  7.78980595e-01, -2.90499475e-01, -1.08363041e+00,
       -6.48790387e-01, -9.00286512e-01, -7.42858131e-01,  8.54129167e-01,
        7.42394266e-01, -1.24770085e-01, -1.96097404e+00, -6.88984511e-01,
        7.11267299e-01, -2.01831626e+00,  1.81203318e-01, -8.69633211e-01,
        3.53082026e-01,  1.12394617e+00, -2.36167319e-01,  1.41040631e+00,
       -6.42696612e-01, -4.59357368e-01, -9.40063808e-01,  1.06841619e+00,
        8.49685967e-01, -9.38912511e-01,  1.86236170e+00, -1.46600979e+00,
        7.39167861e-01,  8.07838196e-01, -9.83199635e-02, -2.91502791e+00,
        8.02643195e-01, -3.77099843e-01,  5.61159632e-01,  3.15750678e-01,
       -6.00544029e-01, -7.78856133e-01, -8.96657256e-01, -1.52179746e+00,
        1.37913662e-01, -1.51416080e+00, -1.71365071e-01,  1.79354421e+00,
       -8.33896420e-01,  6.07733139e-01,  1.76614319e-01, -5.88372596e-01,
        1.28508837e+00,  1.47731784e+00,  1.71944660e-01,  1.85622745e-01,
       -3.97557587e-01, -1.10768839e+00,  1.22914796e+00, -7.03771289e-01,
        7.45573872e-02, -7.85810209e-02,  3.35145794e-01,  3.87104723e-01,
        1.03875318e+00,  3.81254321e-01, -1.45850947e+00,  7.35172022e-01,
       -1.69436509e+00, -5.53270262e-01,  8.65838152e-01,  1.36292736e+00,
       -4.40407422e-01,  6.36884190e-01, -6.67434990e-02,  9.94142906e-01,
       -1.87746570e-01, -2.66429067e-01, -1.67169420e+00, -1.23749380e+00,
        1.28652843e+00, -2.90526727e-01,  1.84186720e+00,  9.21728085e-01,
        9.55023597e-01, -1.69017777e+00, -6.58595193e-01, -9.54383697e-01,
       -1.36006158e+00, -2.22685933e-02, -7.77893819e-01,  1.26805793e+00,
       -8.87627778e-01, -1.19531503e+00,  2.18712102e-01, -1.64545672e+00,
       -1.08056334e+00,  1.41596613e+00, -1.01052254e+00,  1.79230793e-01,
        2.23978149e-01,  2.81679904e+00,  3.93740263e-02,  2.94707242e-01,
        1.07427293e+00, -3.84294489e-01, -2.13565303e-01,  3.70181450e-01,
       -7.42874158e-01,  2.75364383e-01, -1.91980177e-01,  2.51452062e-01,
       -2.83122478e-01, -7.61696324e-01,  3.86027250e-01, -6.69558238e-01,
        1.79577262e+00,  8.75693707e-01, -1.11400059e-01,  7.36383783e-01,
        1.21231073e+00, -1.00174706e+00,  1.92336907e+00,  9.38469385e-01,
        6.01439070e-02,  2.82024000e-01, -5.34023947e-01, -1.52192759e+00,
        2.13533417e-01, -6.80723072e-02,  3.94707624e-01,  4.50827235e-01,
       -4.23241660e-01,  1.44704693e+00,  2.54145007e-01,  8.54966314e-01,
       -1.25367811e+00,  1.03603669e-01, -4.80520695e-01,  7.46071058e-01,
       -1.01662642e+00, -8.96870985e-01, -1.37806625e-01, -2.03206697e+00,
       -9.66993486e-01, -7.37411182e-02, -4.41095286e-01,  7.37399190e-01,
        1.26483191e+00,  5.30337545e-01,  1.27014928e+00, -1.06345525e+00,
        9.23935171e-01,  1.63757775e+00, -6.05070397e-01,  1.34098749e+00,
       -5.41474598e-01, -7.83699864e-01,  1.18442208e+00, -2.15138841e+00])

In [98]:
cats = pd.qcut(data, 4) #distribute data into 4 quartiles

In [99]:
cats.value_counts()

(-2.916, -0.695]    250
(-0.695, 0.0527]    250
(0.0527, 0.745]     250
(0.745, 2.88]       250
dtype: int64

In [100]:
pd.qcut(data, 6).value_counts()

(-2.916, -0.962]    167
(-0.962, -0.437]    167
(-0.437, 0.0527]    166
(0.0527, 0.451]     167
(0.451, 1.024]      166
(1.024, 2.88]       167
dtype: int64

In [101]:
pd.qcut(data, [0, 0.20, 0.40, 0.60, 0.80, 1]).value_counts()

(-2.916, -0.878]    200
(-0.878, -0.235]    200
(-0.235, 0.304]     200
(0.304, 0.914]      200
(0.914, 2.88]       200
dtype: int64

## Detecting and Filtering Outliers

In [102]:
data = pd.DataFrame(data=np.random.randn(1000, 4))

In [103]:
data

            0         1         2         3
0   -1.033564  1.605062 -0.046327  1.046000
1    0.114094 -0.146643 -0.634795  0.107142
2   -0.041166  0.570417 -1.040250 -0.049690
3   -0.768343 -0.446371 -1.135226  1.280530
4    1.368125  0.085290 -0.268204 -0.892880
..        ...       ...       ...       ...
995  1.733191  0.574954  0.905160  0.426486
996  1.128897  0.271849  2.169926  1.024474
997 -1.506079 -0.727875  1.646877 -1.351133
998 -0.383771  0.344013 -1.221490 -0.307183
999 -0.781440 -0.016191  0.438895 -0.365605

[1000 rows x 4 columns]

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.012800    -0.018389    -0.073276     0.003789
std       0.989185     0.988575     0.996988     0.998883
min      -3.244585    -3.062549    -3.541081    -3.116853
25%      -0.686993    -0.671735    -0.713660    -0.652165
50%      -0.006050    -0.015986    -0.082956     0.004676
75%       0.612208     0.655395     0.612366     0.698817
max       3.378623     3.304657     3.013443     3.361630

In [105]:
col_2 = data[2]

In [106]:
col_2[np.abs(col_2) > 3]

340    3.013443
505   -3.541081
Name: 2, dtype: float64

In [107]:
#To select all rows having a value exceeding 3 or –3
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
32  -3.244585  0.805529  0.313707  0.764875
83  -3.012515 -0.191263 -1.832611 -0.441237
205  0.026849  3.304657 -1.476000 -0.412711
299  3.216721 -0.537380 -1.516994  0.188431
340  1.635482 -1.142992  3.013443 -0.367412
461 -0.785647 -3.062549 -2.248448 -0.552984
489  0.070704 -1.801743  2.298547  3.361630
505 -0.983523 -0.523826 -3.541081  0.570007
603  3.148897  0.259233 -1.974085 -0.497529
619  3.378623  1.517292  1.389523  1.058873
751 -0.336786 -0.686044 -0.202146 -3.103342
844  1.534709  0.176706 -0.581861 -3.116853
883 -0.447816  1.200829  1.329516  3.013033
983  0.935160 -2.830069  0.944898 -3.046692

In [108]:
data[(np.abs(data) > 3)] = np.sign(data) * 3

In [109]:
data

            0         1         2         3
0   -1.033564  1.605062 -0.046327  1.046000
1    0.114094 -0.146643 -0.634795  0.107142
2   -0.041166  0.570417 -1.040250 -0.049690
3   -0.768343 -0.446371 -1.135226  1.280530
4    1.368125  0.085290 -0.268204 -0.892880
..        ...       ...       ...       ...
995  1.733191  0.574954  0.905160  0.426486
996  1.128897  0.271849  2.169926  1.024474
997 -1.506079 -0.727875  1.646877 -1.351133
998 -0.383771  0.344013 -1.221490 -0.307183
999 -0.781440 -0.016191  0.438895 -0.365605

[1000 rows x 4 columns]

In [110]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.013287    -0.018631    -0.072748     0.003681
std       0.985996     0.987405     0.995207     0.996874
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.686993    -0.671735    -0.713660    -0.652165
50%      -0.006050    -0.015986    -0.082956     0.004676
75%       0.612208     0.655395     0.612366     0.698817
max       3.000000     3.000000     3.000000     3.000000

In [111]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0 -1.0 -1.0

## Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function.

In [112]:
df = pd.DataFrame(data=(np.arange(5*4).reshape(5, 4)))

In [113]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [114]:
sampler = np.random.permutation(df.shape[0])

In [115]:
sampler

array([2, 1, 4, 3, 0])

In [116]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3

In [117]:
#To select a random subset without replacement, you can use the sample method on Series and DataFrame
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

In [118]:
choices = ser = pd.Series([5, 7, -1, 6, 4])

In [119]:
draws = ser.sample(n=10, replace=True)

In [120]:
draws

3    6
0    5
2   -1
4    4
0    5
2   -1
3    6
0    5
2   -1
2   -1
dtype: int64

## Computing Indicator/Dummy Variables

Another type of transformation for statistical modeling or machine learning applications is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or DataFrame with k columns containing all 1s and 0s.

In [121]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [122]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [123]:
dummies = pd.get_dummies(df['key'])

In [124]:
dummies

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [125]:
df_with_dummy = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(df_with_dummy)

In [126]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [127]:
mnames = ['movie_id', 'title', 'genre']

In [128]:
movies = pd.read_table('movielens/movies.dat', sep='::', header=None, names=mnames)

C:\Users\ABC\anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [129]:
movies

,movie_id,title,genre
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [130]:
all_genre = []

In [131]:
for genre in movies['genre']:
    all_genre.extend(genre.split('|'))

In [132]:
pd.value_counts(all_genre)

Drama          1603
Comedy         1200
Action          503
Thriller        492
Romance         471
Horror          343
Adventure       283
Sci-Fi          276
Children's      251
Crime           211
War             143
Documentary     127
Musical         114
Mystery         106
Animation       105
Fantasy          68
Western          68
Film-Noir        44
dtype: int64

In [133]:
genre = pd.unique(all_genre)

In [134]:
genre

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [135]:
zero_matrix = np.zeros((len(movies), len(genre)))

In [136]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [137]:
dummies = pd.DataFrame(data=zero_matrix, columns=genre)

In [138]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [139]:
for i, gen in enumerate(movies['genre']):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [140]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [141]:
final_dummy = movies[['movie_id', 'title']].join(dummies)

In [142]:
final_dummy

,movie_id,title,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1,Toy Story (1995),1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

A useful recipe for statistical applications is to combine get_dummies with a discretization function like cut:

In [143]:
np.random.seed(12345)

In [144]:
values = np.random.rand(10)

In [145]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [146]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [147]:
dummies = pd.get_dummies(pd.cut(values, bins))

In [148]:
dummies

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

## String Object Methods

In [149]:
val = 'a, b, guido, github'

In [150]:
val.split(',') #string can be broken into pieces with split()

['a', ' b', ' guido', ' github']

In [151]:
#split is often combined with strip to trim whitespace (including line breaks):
pieces = [x.strip() for x in val.split(',')]

In [152]:
pieces

['a', 'b', 'guido', 'github']

In [153]:
first, second, third, fourth = pieces

In [154]:
first + "::" + second + "::" + third + "::" + fourth #Not a practical generic method

'a::b::guido::github'

In [155]:
"::".join(pieces)

'a::b::guido::github'

In [156]:
val

'a, b, guido, github'

In [157]:
'guido' in val

True

In [158]:
val.find('g')

6

In [159]:
val.find(':')

-1

In [160]:
val.index('g')

6

In [161]:
"val.index(':')" #Raises an exception of ValueError

"val.index(':')"

In [162]:
val.count(',')

3

In [163]:
val.count('g')

2

In [164]:
val.count(':')

0

In [165]:
val

'a, b, guido, github'

In [166]:
val.replace(', ', '::')

'a::b::guido::github'

In [167]:
a = val.replace(',', ' ')

In [168]:
a

'a  b  guido  github'

*See Table 7-3 for a listing of some of Python’s string methods.*

![Listing of some of Python’s string methods](Img/7.3.png)

In [169]:
val = "Dilory Pam Pah Pah Pa Rara Ra"

In [170]:
val.endswith('a Ra')

True

In [171]:
val.startswith('Dilo')

True

In [172]:
val.rfind('Ra') #index of 'R'

27

## Regular Expressions

Regular expressions provide a flexible way to search or match (often more complex)
string patterns in text. A single expression, commonly called a regex, is a string
formed according to the regular expression language.

The re module functions fall into three categories: pattern matching, substitution,
and splitting.

In [173]:
import re

In [174]:
text = "My    name     is          Danish Hudani"

In [175]:
regex = re.compile('\s+') #One or more white spaces

In [176]:
regex.split(text)

['My', 'name', 'is', 'Danish', 'Hudani']

In [177]:
regex.findall(text)

['    ', '     ', '          ', ' ']

In [178]:
print(r'C:\x') #instead of

C:\x

In [179]:
print('C:\\x')

C:\x

In [180]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [181]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+.[A-Z]'

In [182]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [183]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [184]:
m = regex.search(text) #searches the 1st object

In [185]:
m

In [186]:
text[m.start():m.end()]

'dave@google.com'

In [187]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [188]:
pattern =  r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [189]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [190]:
m = regex.match('danish.hud95@gmail.com')

In [191]:
m

In [192]:
m.groups()

('danish.hud95', 'gmail', 'com')

In [193]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [194]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

*Table 7-4. Regular expression methods*

![Regular expression methods](Img/7.4.png)

## Vectorized String Functions in pandas

In [210]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [211]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [212]:
data = pd.Series(data)

In [213]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [214]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [215]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [216]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [217]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [220]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [223]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [258]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

*Table 7-5. Partial listing of vectorized string methods*

![Partial listing of vectorized string methods](Img/7.5a.png)

![Partial listing of vectorized string methods](Img/7.5b.png)